Merge pull request #73 from AIappsGBBFactory/v2/jinle-more-fixes
Updated documentation based on new scenario-based structure, added proposal for speckit integration
